dreamdrive/Meridian_LITE/Meridian_LITE_for_ESP32/src/main.cpp
/**                                                                                   \
 * @file    Meridian_LITE_for_ESP32/src/main.cpp                                      \
 * @brief   Meridian is a system that smartly realizes the digital twin of a robot.   \
 * @details Meridian_LITE_v1.0.1_20230915 for Meridan Board -LITE- with ESP32DecKitC. \
 *                                                                                    \
 * This code is licensed under the MIT License.                                       \
 * Copyright (c) 2022 Izumi Ninagawa & Project Meridian                               \
 */

#define VERSION "Hello, This is Meridian_LITE_v1.0.1_20230915." // バージョン表示

// [ 概 要 ] ///////////////////////////////////////////////////////////////////////
// Meridianはサーボやセンサーの状態が格納されたMeridim90というデータ配列を, PCと100Hzで共有します.
// ハードウェアの制限上, サーボ値の返信に若干の取りこぼしがありますが, 取りこぼす直前のデータを使うなど
// の処理で擬似的に安定させています.
// ICSサーボの返信データはサーボ由来の揺らぎがあるため現状では参考値と考えるのがよく,サーボ値を指示して
// 動作させることが基本的な利用法となります.
// Meridian_LITE は, ESP32DevkitC + Meridian board -LITE- の組み合わせで使用します.

// [ 利 用 プ ラ ッ ト フ ォ ー ム ] //////////////////////////////////////////////////
//  ESP32 DevkitC + PlatformIOで使うことを想定
//  PlatformIO上でのESP32のボードバージョンは3.5.0が良い.（4系はうまく動かないらしい）
//  Serial1を使うには設定を変更する必要あり. 参考 → https://qiita.com/Ninagawa_Izumi/items/8ce2d55728fd5973087d

// [ デ フ ォ ル ト の ハ ー ド ウ ェ ア ] /////////////////////////////////////////////
// 100Hz通信で安定動作します.
// デフォルトの環境設定は
// ① Meridian Board -LITE- に Espressif ESP32DevKitCを搭載.
// ② ICSサーボL,R 11個ずつ合計22軸分を接続
// ③ リモコン KRC-5FH + KRR-5FH
// ④ 9軸センサ BNO005を搭載
// ⑤ SDカード(SPIに接続)は不搭載
//
// 上記を搭載している場合,
// サーボについてはconfig.h内にて下記の初期設定をしておいてください.
// IDL_MT0 - IDR_MT14     : 各サーボのマウントありなし(デフォルトはKHR - 3HVの22軸設定.)
// IDL_CW0 - IDR_CW14     : 各サーボの回転方向の正負補正
// IDL_TRIM0 - IDR_TRIM14 : 直立時の各サーボのデフォルト値
// その他については,config.h内の SD_MOUNT,MOUNT_IMUAHRS,MOUNT_JOYPAD などをそれぞれ設定します.

// [ WIFI設定 ] ////////////////////////////////////////////////////////////////////
// サーボについてはkeys.h内の /* Wifiアクセスポイントの設定 */ にて
// WIFI_AP_SSID, WIFI_AP_PASS, WIFI_SEND_IP を設定してください.
// PCのIPアドレスはPC側で調べてください.
// ESP32側のIPアドレス, BluetoothMACアドレスはEPS32の起動時にシリアルモニタに表示されます.

// [ バージョン情報 ] ////////////////////////////////////////////////////////////////
// v1.0.1 (20230820)
// ・公式ライブラリの<Meridian.h>に対応しました.
// ・wiimote(wiiリモコン)にデフォルト対応しました.
// ・bno055のヨー軸データが原点リセットに対応し、-180〜180度を取得できるようにしました.
// ・サーボの断線検出に対応しました.
// ・SSIDなどのパスワードを含むヘッダファイルをkeys.hに隔離しました.

//================================================================================================================
//---- 初 期 設 定  -----------------------------------------------------------------------------------------------
//================================================================================================================

/* コンフィグファイルの読み込み */
#include "config.h"
#include "keys.h"

/* ヘッダファイルの読み込み */
#include "main.h"

/* ライブラリ導入 */
#include <Arduino.h>
#include <Meridian.h>           // Meridianのライブラリ導入
MERIDIANFLOW::Meridian mrd;     // ライブラリのクラスを mrdという名前でインスタンス化
//#include <WiFi.h>               // WiFi通信用ライブラリ      -- 2024/01/14 コメントアウト WIFIから有線LANへ
//#include <WiFiUdp.h>            // UDP通信用ライブラリ       -- 2024/01/14 コメントアウト WIFIから有線LANへ
//WiFiUDP udp;                    // wifi設定                  -- 2024/01/14 コメントアウト WIFIから有線LANへ
//#include <IcsHardSerialClass.h> // KONDOサーボのライブラリ    -- 2024/01/06 コメントアウト KONDOからROBOTISへ
#include <Wire.h>               // I2C通信用ライブラリ
#include <Adafruit_BNO055.h>    // 9軸センサBNO055用のライブラリ
#include <ESP32Wiimote.h>       // Wiiコントローラーのライブラリ
ESP32Wiimote wiimote;           // Wiiコントローラー設定
#include <SPI.h>                // SPIのライブラリ
#include <SD.h>                 // SDカード用のライブラリ

#include <Dynamixel2Arduino.h>  // Dynamixelのライブラリ -- 2024/01/06 追加
#include <Ethernet2.h>          // 有線LANの追加(SPI接続) -- 2024/01/14 追加
                                // MeridianのSPIがSPI3との接続のため、w5500.cppとw5500.hも一部修正(begin関数とCSピンの定義について)
#include <EthernetUDP2.h>       // 有線LANの追加(SPI接続) -- 2024/01/14 追加
EthernetUDP udp;                // 有線LANの追加(SPI接続) -- 2024/01/14 追加

// 自局MACアドレスと自局IPアドレス (有線LAN)----------------------------------
// 現時点では、key.hのFIXED_IP_ADDRよりこちらが優先されてしまう。
byte mac[] = {
  0xDE, 0xAD, 0xBE, 0xEF, 0xFE, 0xED
};
IPAddress ip(192, 168, 7, 107);

// 送信先IPは、key.hのWIFI_SEND_IPに記載してください。

// 自局MACアドレスと自局IPアドレス (有線LAN)----------------------------------

//---------------------------------------------------
//                   DYNAMIXEL関連 
//---------------------------------------------------

#define DEBUG_SERIAL Serial
#define DXL_SERIAL_L Serial1
#define DXL_SERIAL_R Serial2
const uint8_t DXL_DIR_PIN_L = 33; // DYNAMIXEL Shield DIR PIN
const uint8_t DXL_DIR_PIN_R = 4;  // DYNAMIXEL Shield DIR PIN

//Please see eManual Control Table section of your DYNAMIXEL.
//This example is written based on DYNAMIXEL X series(excluding XL-320)
#define ID_ADDR                 7
#define ID_ADDR_LEN             1
#define BAUDRATE_ADDR           8
#define BAUDRATE_ADDR_LEN       1
#define PROTOCOL_TYPE_ADDR      13
#define PROTOCOL_TYPE_ADDR_LEN  1
#define TIMEOUT 20    //default communication timeout 10ms
#define OPERATING_MODE_ADDR         11
#define OPERATING_MODE_ADDR_LEN     1
#define TORQUE_ENABLE_ADDR          64
#define TORQUE_ENABLE_ADDR_LEN      1
#define LED_ADDR                    65
#define LED_ADDR_LEN                1
#define GOAL_POSITION_ADDR          116
#define GOAL_POSITION_ADDR_LEN      4
#define PRESENT_POSITION_ADDR       132
#define PRESENT_POSITION_ADDR_LEN   4
#define POSITION_CONTROL_MODE       3

uint8_t turn_on = 1;
uint8_t turn_off = 0;
uint8_t returned_id = 0;
uint8_t returned_baudrate = 0;
uint8_t returned_protocol = 0;

const float DXL_PROTOCOL_VERSION = 2.0;

uint8_t operatingMode = POSITION_CONTROL_MODE;

uint32_t goalPosition1;
uint32_t presentPosition1;

Dynamixel2Arduino dxl_L(DXL_SERIAL_L, DXL_DIR_PIN_L);
Dynamixel2Arduino dxl_R(DXL_SERIAL_R, DXL_DIR_PIN_R);

int dx_result;

//---------------------------------------------------
//       ↑↑↑↑↑↑      DYNAMIXEL関連　　　　 ↑↑↑↑↑↑
//---------------------------------------------------

/* ICSサーボのインスタンス設定 */
// IcsHardSerialClass krs_L(&Serial1, PIN_EN_L, ICS_BAUDRATE, ICS_TIMEOUT); // サーボL系統UARTの設定（TX27,RX32,EN33）
// IcsHardSerialClass krs_R(&Serial2, PIN_EN_R, ICS_BAUDRATE, ICS_TIMEOUT); // サーボR系統UARTの設定（TX17,RX16,EN4）

/* Meridim配列設定 */
const int MSG_BUFF = MSG_SIZE * 2;     // Meridim配列のバイト長
const int MSG_ERR = MSG_SIZE - 2;      // エラーフラグの格納場所（配列の末尾から2つめ）
const int MSG_ERR_u = MSG_ERR * 2 + 1; // エラーフラグの格納場所（上位8ビット）
const int MSG_ERR_l = MSG_ERR * 2;     // エラーフラグの格納場所（下位8ビット）
const int MSG_CKSM = MSG_SIZE - 1;     // チェックサムの格納場所（配列の末尾）

/* Meridim配列用の共用体の設定 */
typedef union // Meridim配列用の共用体の設定
{
  short sval[MSG_SIZE + 4];           // short型でデフォルト90個の配列データを持つ
  unsigned short usval[MSG_SIZE + 2]; // 上記のunsigned short型
  uint8_t bval[MSG_BUFF + 4];         // 1バイト単位でデフォルト180個の配列データを持つ
} UnionData;
UnionData s_udp_meridim = {0}; // UDP送信用共用体のインスタンスを宣言
UnionData r_udp_meridim = {0}; // UDP受信用共用体のインスタンスを宣言

/* システム用変数 */
TaskHandle_t thp[4];                                           // マルチスレッドのタスクハンドル格納用
File myFile;                                                   // SDカード用
int servo_num_max = max(MOUNT_SERVO_NUM_L, MOUNT_SERVO_NUM_R); // サーボ送受信のループ処理数（L系R系で多い方）

/* フラグ関連変数 */
bool udp_rsvd_flag = 0; // UDPの受信終了フラグ

/* タイマー管理用の変数 */
long frame_ms = FRAME_DURATION;  // 1フレームあたりの単位時間(ms)
long mrd_t_mil = (long)millis(); // フレーム管理時計の時刻 Meridian Time.
long now_t_mil = (long)millis(); // 現在時刻をミリ秒で取得
long now_t_mic = (long)micros(); // 現在時刻をマイクロ秒で取得
int frame_count = 0;             // サイン計算用の変数
int frame_count_diff = 2;        // サインカーブ動作などのフレームカウントをいくつずつ進めるか
int frame_count_max = 360000;    // フレームカウントの最大値
int joypad_polling_count = 0;    // JOYPADのデータを読みに行くためのフレームカウント
int mrd_seq_s_increment = 0;     // フレーム毎に0-59999をカウントし、送信
int mrd_seq_r_expect = 0;        // フレーム毎に0-59999をカウントし、受信値と比較

/* エラーカウント用 */
int err_pc_esp = 0; // ESP32の受信エラー（PCからのUDP）

