dreamdrive/Meridian_LITE/Meridian_LITE_for_ESP32/src/main.cpp
/* 各種モード設定 */
//

/* リモコン用変数 */
typedef union
{
  short sval[4];       // short型で4個の配列データを持つ
  uint16_t usval[4];   // 上記のunsigned short型
  int8_t bval[8];      // 上記のbyte型
  uint8_t ubval[8];    // 上記のunsigned byte型
  uint64_t ui64val[1]; // 上記のunsigned int16型
                       // button, pad_stick_L_x:pad_stick_L_y,
                       // pad_stick_R_x:pad_stick_R_y, pad_L2_val:pad_R2_val
} UnionPad;
UnionPad pad_array = {0}; // リモコン値格納用の配列
unsigned short pad_btn = 0;
int pad_stick_R = 0;
int pad_stick_R_x = 0;
int pad_stick_R_y = 0;
int pad_stick_L = 0;
int pad_stick_L_x = 0;
int pad_stick_L_y = 0;
int pad_stick_V = 0;
int pad_R2_val = 0;
int pad_L2_val = 0;

/* センサー(BNO055)用の変数*/
Adafruit_BNO055 bno = Adafruit_BNO055(55, 0x28, &Wire);
float bno055_read[16];        // bno055のデータの一時保存
float imuahrs_yaw_origin = 0; // ヨー軸の原点セット用
float imuahrs_yaw_source = 0; // ヨー軸のソースデータ保持用

/* 各サーボのマウントありなし */
int idl_mount[15] = {IDL_MT0, IDL_MT1, IDL_MT2, IDL_MT3, IDL_MT4, IDL_MT5, IDL_MT6, IDL_MT7, IDL_MT8, IDL_MT9, IDL_MT10, IDL_MT11, IDL_MT12, IDL_MT13, IDL_MT14}; // L系統
int idr_mount[15] = {IDR_MT0, IDR_MT1, IDR_MT2, IDR_MT3, IDR_MT4, IDR_MT5, IDR_MT6, IDR_MT7, IDR_MT8, IDR_MT9, IDR_MT10, IDR_MT11, IDR_MT12, IDR_MT13, IDR_MT14}; // R系統
int id3_mount[15] = {0};                                                                                                                                          // 3系統

/* 各サーボの正逆方向補正用配列 */
int idl_cw[15] = {IDL_CW0, IDL_CW1, IDL_CW2, IDL_CW3, IDL_CW4, IDL_CW5, IDL_CW6, IDL_CW7, IDL_CW8, IDL_CW9, IDL_CW10, IDL_CW11, IDL_CW12, IDL_CW13, IDL_CW14}; // L系統
int idr_cw[15] = {IDR_CW0, IDR_CW1, IDR_CW2, IDR_CW3, IDR_CW4, IDR_CW5, IDR_CW6, IDR_CW7, IDR_CW8, IDR_CW9, IDR_CW10, IDR_CW11, IDR_CW12, IDR_CW13, IDR_CW14}; // R系統

/* 各サーボの直立ポーズトリム値(degree) */
// float idl_trim[15] = {IDL_TRIM0, IDL_TRIM1, IDL_TRIM2, IDL_TRIM3, IDL_TRIM4, IDL_TRIM5, IDL_TRIM6, IDL_TRIM7, IDL_TRIM8, IDL_TRIM9, IDL_TRIM10, IDL_TRIM11, IDL_TRIM12, IDL_TRIM13, IDL_TRIM14}; // L系統
// float idr_trim[15] = {IDR_TRIM0, IDR_TRIM1, IDR_TRIM2, IDR_TRIM3, IDR_TRIM4, IDR_TRIM5, IDR_TRIM6, IDR_TRIM7, IDR_TRIM8, IDR_TRIM9, IDR_TRIM10, IDR_TRIM11, IDR_TRIM12, IDR_TRIM13, IDR_TRIM14}; // R系統

/* サーボのポジション用配列 */
int s_servo_pos_L[15] = {0}; // 15要素 100倍したdegree値
int s_servo_pos_R[15] = {0}; // 15要素 100倍したdegree値


// int s_DXL_servo_pos_L[] = {2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048}; //15要素
// int s_DXL_servo_pos_R[] = {2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048}; //15要素
// int r_DXL_servo_pos_L[] = {2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048}; //15要素
// int r_DXL_servo_pos_R[] = {2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048, 2048}; //15要素


/* 各サーボのポジション値(degree) */
float idl_tgt[15] = {0};      // L系統の目標値
float idr_tgt[15] = {0};      // R系統の目標値
float idl_tgt_past[15] = {0}; // L系統の前回の値
float idr_tgt_past[15] = {0}; // R系統の前回の値

/* サーボのエラーカウンタ配列 */
int idl_err[15] = {0}; // 15要素
int idr_err[15] = {0}; // 15要素

/* 計算用変数 */
float n; // 計算用
int k;   // 各サーボの計算用変数

//================================================================================================================
//---- S E T  U P -----------------------------------------------------------------------------------------------
//================================================================================================================
void setup()
{
  /* ピンモードの設定 */
  pinMode(ERR_LED, OUTPUT); // エラー通知用LED

  /* PC用シリアルの設定 */
  Serial.begin(SERIAL_PC_BPS);

  /* サーボモーター用シリアルの設定 */
  // krs_L.begin();
  // krs_R.begin();

  // Dynamixelの設定
  dxl_R.begin(1000000);
  dxl_R.setPortProtocolVersion(DXL_PROTOCOL_VERSION);
  dxl_L.begin(1000000);
  dxl_L.setPortProtocolVersion(DXL_PROTOCOL_VERSION);

  delay(200);

  /* 起動メッセージ1 */
  mrd.print_esp_hello_start(VERSION, String(SERIAL_PC_BPS), WIFI_AP_SSID);

  /* WiFiの初期化と開始 */
  // init_wifi(WIFI_AP_SSID, WIFI_AP_PASS);
  // while (WiFi.status() != WL_CONNECTED)
  // {           // https://www.arduino.cc/en/Reference/WiFiStatus 戻り値一覧
  //   delay(1); // 接続が完了するまでループで待つ
  // }

  Ethernet.begin(mac, ip);

  /* 起動メッセージ2 */
  //mrd.print_esp_hello_ip(WIFI_SEND_IP, WiFi.localIP().toString(), FIXED_IP_ADDR, MODE_FIXED_IP);
  mrd.print_esp_hello_ip(WIFI_SEND_IP, Ethernet.localIP().toString(), FIXED_IP_ADDR, MODE_FIXED_IP);

  /* UDP通信の開始 */
  udp.begin(UDP_RESV_PORT);

  /* Bluetoothリモコン関連の処理 */
  bt_settings();

  /* I2Cの開始 */
  Wire.begin(22, 21);

  /* センサの初期化 */
  init_imuahrs(MOUNT_IMUAHRS);

  /* スレッドの開始 */
  if (MOUNT_IMUAHRS == 3)
  {
    xTaskCreatePinnedToCore(Core1_bno055_r, "Core1_bno055_r", 4096, NULL, 10, &thp[0], 1);
    Serial.println("Core1 thread for bno055 start.");
    delay(10); // センサー用スレッド
  }

  /* SDカードの初期設定とチェック */
  check_sd();

  /* マウントされたサーボIDの表示 */
  mrd.print_servo_mounts(idl_mount, idr_mount, id3_mount);

  /* JOYPADの認識 */
  mrd.print_controlpad(MOUNT_JOYPAD, JOYPAD_POLLING);

  /* Bluetoothの初期化 */
  uint8_t bt_mac[6];
  String self_mac_address = "";
  esp_read_mac(bt_mac, ESP_MAC_BT); // ESP32自身のBluetoothMacアドレスを表示
  self_mac_address = String(bt_mac[0], HEX) + ":" + String(bt_mac[1], HEX) + ":" + String(bt_mac[2], HEX) + ":" + String(bt_mac[3], HEX) + ":" + String(bt_mac[4], HEX) + ":" + String(bt_mac[5], HEX);
  Serial.print("ESP32's Bluetooth Mac Address is => " + self_mac_address);
  Serial.println();
  delay(1000);

  /* タイマーの調整と開始のシリアル表示 */
  mrd_t_mil += (long)millis() + 10;                                   // 周期管理用のMeridianTimeをリセット
  Serial.println("-) Meridian -LITE- system on ESP32 now flows. (-"); //

  /* UDP開始用のダミーデータの生成 */
  if (UDP_SEND) // 設定でUDPの送信を行うかどうか決定
  {
    s_udp_meridim.sval[MSG_CKSM] = mrd.cksm_val(s_udp_meridim.sval, MSG_SIZE);
    sendUDP();
    mrd.monitor_check_flow("[start]", MONITOR_FLOW);
  }



  for (int i = 0; i < 15; i++) {
    //dxl_L.torqueOff(i);
    dx_result = dxl_L.setOperatingMode(i, OP_POSITION);
    dx_result = dxl_L.torqueOn(i);

    //dxl_R.torqueOff(i);
    dx_result = dxl_R.setOperatingMode(i, OP_POSITION);
    dx_result = dxl_R.torqueOn(i);
    Serial.println("torque on"); //
  }

  //   // Set Goal Position in DEGREE value
  // dx_result = dxl_R.setGoalPosition(1, 0, UNIT_DEGREE);
  //   if(dx_result != 1) Serial.println("Dynamixel ERR.");
  // dx_result = dxl_L.setGoalPosition(1, 0, UNIT_DEGREE);
  //   if(dx_result != 1) Serial.println("Dynamixel ERR.");
  // Serial.println("go position"); //

