dreamdrive/Meridian_LITE/Meridian_LITE_for_ESP32/src/main.cpp
}

// ■ degreeをDynamixel値に変換 ----------------------------------------------------
int Deg2Dxl(float degree) { //degreeにはidl_d[i] * idl_pn[i]、id_nにはidl_n[i]を入れる(左の場合は左半身系)
  return (int)((degree * 4096 / 360) + 2048) ;
}

// ■ Dynamixelをdegree値に変換 -----------------------------------------------------
float Dxl2Deg(int dxl) { //KRS値のほか idl_n[i], idl_pn[i] を入れる(右の場合はidr系)
  float x = 1.0 * ((dxl - 2048) * 360) / 4096 ;
  return x;
}


//================================================================================================================
//---- M A I N  L O O P -----------------------------------------------------------------------------------------
//================================================================================================================
void loop()
{

  //////// < 1 > U D P 受 信 ///////////////////////////////////////////////////////
  // @ [1-1] UDP受信の実行 もしデータパケットが来ていれば受信する
  if (UDP_RESEIVE) // UDPの受信を行うかどうか
  {
    receiveUDP(); // UDPを受信
    if (udp_rsvd_flag)
    {
      mrd.monitor_check_flow("[Rsvd]", MONITOR_FLOW); // デバグ用フロー表示
      udp_rsvd_flag = 0;
    }
  }
  // 　→ ここでr_udp_meridim.sval に受信したMeridim配列が入っている状態。

  // @ [1-2] チェックサムを確認
  if (mrd.cksm_rslt(r_udp_meridim.sval, MSG_SIZE)) // Check sum OK!
  {
    mrd.monitor_check_flow("[CSok]", MONITOR_FLOW); // デバグ用フロー表示

    // @ [1-3] UDP受信配列から UDP送信配列にデータを転写
    memcpy(s_udp_meridim.bval, r_udp_meridim.bval, MSG_SIZE * 2);

    // @ [1-4] エラーフラグ14番(ESP32のPCからのUDP受信エラー検出)をオフ
    s_udp_meridim.bval[MSG_ERR_u] &= B10111111;

    //
    mrd.monitor_check_flow("[1]", MONITOR_FLOW); // デバグ用フロー表示

    //////// < 2 > リ モ コ ン 受 信 ///////////////////////////////////////////////////
    // @ [2-1] コントロールパッド受信値の転記
    if (MOUNT_JOYPAD != 0)
    {
      pad_array.ui64val[0] = joypad_read(MOUNT_JOYPAD, pad_array.ui64val[0], JOYPAD_POLLING, JOYPAD_REFRESH);
      s_udp_meridim.usval[MRD_CONTROL_BUTTONS] = pad_array.usval[0];
      if (MONITOR_JOYPAD)
      {
        monitor_joypad(pad_array.usval);
      }
      //
      mrd.monitor_check_flow("[2]", MONITOR_FLOW); // デバグ用フロー表示
    }

    //////// < 3 > 受 信 コ マ ン ド に 基 づ く 制 御 処 理 /////////////////////////////
    // @[3-1] マスターコマンドの判定により工程の実行orスキップを分岐
    execute_MasterCommand(); // マスターコマンドの実行

    //
    mrd.monitor_check_flow("[3]", MONITOR_FLOW); // デバグ用フロー表示

    //////// < 4 > E S P 内 部 で 位 置 制 御 す る 場 合 の 処 理 ///////////////////////
    // @[4-1] 現在はとくに設定なし

    //
    mrd.monitor_check_flow("[4]", MONITOR_FLOW); // デバグ用フロー表示

    //////// < 5 > サ ー ボ 動 作 の 実 行 /////////////////////////////////////////////
    // @ [5-1] UDPから受信したサーボ位置をサーボ配列に書き込む
    for (int i = 0; i < servo_num_max; i++)
    {
      idl_tgt_past[i] = idl_tgt[i];                       // 前回のdegreeをキープ
      idr_tgt_past[i] = idr_tgt[i];                       // 前回のdegreeをキープ
      idl_tgt[i] = s_udp_meridim.sval[i * 2 + 21] * 0.01; // 受信したdegreeを格納
      idr_tgt[i] = s_udp_meridim.sval[i * 2 + 51] * 0.01; // 受信したdegreeを格納
    }

    // @ [5-2] サーボ受信値の処理
    if (!ESP32_STDALONE)
    {
      if (s_udp_meridim.sval[MRD_MASTER] != 0)
      {
        for (int i = 0; i < servo_num_max; i++) // ICS_L系統の処理
        {                                       // 接続したサーボの数だけ繰り返す。最大は15
          if (idl_mount[i])
          {
            if (s_udp_meridim.sval[(i * 2) + 20] == 1) // 受信配列のサーボコマンドが1ならPos指定
            {
              //k = krs_L.setPos(i, mrd.Deg2Krs(idl_tgt[i], idl_trim[i], idl_cw[i])); ★★★★★★★★★★★★★★★★★★★★★★

              DEBUG_SERIAL.print("Sending :");
              DEBUG_SERIAL.println(i);

              // Turn on torque
              if(dxl_L.write(i, TORQUE_ENABLE_ADDR, (uint8_t*)&turn_on, TORQUE_ENABLE_ADDR_LEN, TIMEOUT))
                DEBUG_SERIAL.println("Torque on");
              else
                DEBUG_SERIAL.println("Error: Torque on failed");

              goalPosition1 = Deg2Dxl(idl_tgt[i]);
              dxl_L.write(i, GOAL_POSITION_ADDR, (uint8_t*)&goalPosition1, GOAL_POSITION_ADDR_LEN, TIMEOUT);
              dxl_L.read(i, PRESENT_POSITION_ADDR, PRESENT_POSITION_ADDR_LEN, (uint8_t*)&presentPosition1, sizeof(presentPosition1), TIMEOUT);
              k = presentPosition1;


              if (k == -1) // サーボからの返信信号を受け取れなかった時は前回の数値のままにする
              {
                //k = mrd.Deg2Krs(idl_tgt_past[i], idl_trim[i], idl_cw[i]);
                k = Deg2Dxl(idl_tgt_past[i]);

                idl_err[i]++;
                if (idl_err[i] >= SERVO_LOST_ERROR_WAIT)
                {
                  s_udp_meridim.bval[MSG_ERR_l] = char(i); // Meridim[MSG_ERR] エラーを出したサーボID（0をID[L00]として[L99]まで）
                  mrd.monitor_servo_error("L", i, MONITOR_SERVO_ERR);
                }
              }
              else
              {
                idl_err[i] = 0;
              }
            }
            else // 1以外ならとりあえずサーボを脱力し位置を取得。手持ちの最大は15
            {
              //k = krs_L.setFree(i); // サーボからの返信信号を受け取れていれば値を更新★★★★★★★★★★★★★★★★★★★★★
              
              // Turn off torque
              if(dxl_L.write(i, TORQUE_ENABLE_ADDR, (uint8_t*)&turn_off, TORQUE_ENABLE_ADDR_LEN, TIMEOUT))
                DEBUG_SERIAL.println("Torque on");
              else
                DEBUG_SERIAL.println("Error: Torque on failed");

              dxl_L.read(i, PRESENT_POSITION_ADDR, PRESENT_POSITION_ADDR_LEN, (uint8_t*)&presentPosition1, sizeof(presentPosition1), TIMEOUT);
              k = presentPosition1;

              if (k == -1)          // サーボからの返信信号を受け取れなかった時は前回の数値のままにする
              {
                //k = mrd.Deg2Krs(idl_tgt_past[i], idl_trim[i], idl_cw[i]);
                k = Deg2Dxl(idl_tgt_past[i]);
                
                idl_err[i]++;
                if (idl_err[i] >= SERVO_LOST_ERROR_WAIT)
                {
                  s_udp_meridim.bval[MSG_ERR_l] = char(i); // Meridim[MSG_ERR] エラーを出したサーボID（0をID[L00]として[L99]まで）
                  mrd.monitor_servo_error("L", i, MONITOR_SERVO_ERR);
                }
              }
              else
              {
                idl_err[i] = 0;
              }
            }
            //idl_tgt[i] = mrd.Krs2Deg(k, idl_trim[i], idl_cw[i]);
            idl_tgt[i] = Dxl2Deg(k);
          }
          delayMicroseconds(1);

          if (idr_mount[i])
          {
            if (s_udp_meridim.sval[(i * 2) + 50] == 1) // 受信配列のサーボコマンドが1ならPos指定
            {
              //k = krs_R.setPos(i, mrd.Deg2Krs(idr_tgt[i], idr_trim[i], idr_cw[i]));★★★★★★★★★★★★★★★

