dreamdrive/Meridian_LITE/Meridian_LITE_for_ESP32/src/main.cpp
              // Turn on torque
              if(dxl_R.write(i, TORQUE_ENABLE_ADDR, (uint8_t*)&turn_on, TORQUE_ENABLE_ADDR_LEN, TIMEOUT))
                DEBUG_SERIAL.println("Torque on");
              else
                DEBUG_SERIAL.println("Error: Torque on failed");

              //goalPosition1 = s_DXL_servo_pos_R[i];
              goalPosition1 = Deg2Dxl(idl_tgt[i]);
              dxl_R.write(i, GOAL_POSITION_ADDR, (uint8_t*)&goalPosition1, GOAL_POSITION_ADDR_LEN, TIMEOUT);
              dxl_R.read(i, PRESENT_POSITION_ADDR, PRESENT_POSITION_ADDR_LEN, (uint8_t*)&presentPosition1, sizeof(presentPosition1), TIMEOUT);
              k = presentPosition1;

              if (k == -1) // サーボからの返信信号を受け取れなかった時は前回の数値のままにする
              {
                //k = mrd.Deg2Krs(idr_tgt_past[i], idr_trim[i], idr_cw[i]);
                k = Deg2Dxl(idl_tgt_past[i]);
                idr_err[i]++;
                if (idr_err[i] >= SERVO_LOST_ERROR_WAIT)
                {
                  s_udp_meridim.bval[MSG_ERR_l] = char(i + 100); // Meridim[MSG_ERR] エラーを出したサーボID（100をID[R00]として[R99]まで）
                  mrd.monitor_servo_error("R", i + 100, MONITOR_SERVO_ERR);
                }
              }
              else
              {
                idr_err[i] = 0;
              }
            }
            else // 1以外ならとりあえずサーボを脱力し位置を取得
            {
              //k = krs_R.setFree(i);★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★★

              // Turn off torque
              if(dxl_R.write(i, TORQUE_ENABLE_ADDR, (uint8_t*)&turn_off, TORQUE_ENABLE_ADDR_LEN, TIMEOUT))
                DEBUG_SERIAL.println("Torque on");
              else
                DEBUG_SERIAL.println("Error: Torque on failed");

              dxl_R.read(i, PRESENT_POSITION_ADDR, PRESENT_POSITION_ADDR_LEN, (uint8_t*)&presentPosition1, sizeof(presentPosition1), TIMEOUT);
              k = presentPosition1;


              if (k == -1) // サーボからの返信信号を受け取れなかった時は前回の数値のままにする
              {
                //k = mrd.Deg2Krs(idr_tgt_past[i], idr_trim[i], idr_cw[i]);
                k = Deg2Dxl(idr_tgt_past[i]);
                
                idr_err[i]++;
                if (idr_err[i] >= SERVO_LOST_ERROR_WAIT)
                {
                  s_udp_meridim.bval[MSG_ERR_l] = char(i + 100); // Meridim[MSG_ERR] エラーを出したサーボID（100をID[R00]として[R99]まで）
                  mrd.monitor_servo_error("R", i + 100, MONITOR_SERVO_ERR);
                }
              }
              else
              {
                idr_err[i] = 0;
              }
            }
            //idr_tgt[i] = mrd.Krs2Deg(k, idr_trim[i], idr_cw[i]);
            idl_tgt[i] = Dxl2Deg(k);
          }
          delayMicroseconds(1);
        }

        //
        mrd.monitor_check_flow("[5]", MONITOR_FLOW); // デバグ用フロー表示
      }
    }
    else
    {
      // ボード単体動作モードの場合はサーボの戻り値を調べず、L0番サーボ値として+-30度のサインカーブの値を返す
      idl_tgt[0] = sin(frame_count * M_PI / 180.0) * 30; //
      //
    }
  }
  else // Check sum NG
  {
    err_pc_esp++;
    s_udp_meridim.bval[MSG_ERR_u] |= B01000000;     // エラーフラグ14番(ESP32のPCからのUDP受信エラー検出)をオン
    mrd.monitor_check_flow("[csNG]", MONITOR_FLOW); // デバグ用フロー表示
  }

  //////// < 6 > サ ー ボ 受 信 値 の 処 理 //////////////////////////////////////////
  // @[6-1] サーボIDごとにの現在位置もしくは計算結果を配列に格納
  for (int i = 0; i < 15; i++)
  {
    // s_udp_meridim.sval[i * 2 + 20] = 0;                              // 仮にここでは各サーボのコマンドを脱力&ポジション指示(0)に設定
    s_udp_meridim.sval[i * 2 + 21] = mrd.float2HfShort(idl_tgt[i]); // 仮にここでは最新のサーボ角度degreeを格納
  }
  for (int i = 0; i < 15; i++)
  {
    // s_udp_meridim.sval[i * 2 + 50] = 0;                              // 仮にここでは各サーボのコマンドを脱力&ポジション指示(0)に設定
    s_udp_meridim.sval[i * 2 + 51] = mrd.float2HfShort(idr_tgt[i]); // 仮にここでは最新のサーボ角度degreeを格納
  }

  //
  mrd.monitor_check_flow("[6]", MONITOR_FLOW); // デバグ用フロー表示

  //////// < 7 > エ ラ ー リ ポ ー ト の 作 成 ///////////////////////////////////////
  // @[7-1] シーケンス番号チェック
  mrd_seq_r_expect = mrd.seq_predict_num(mrd_seq_r_expect);                                // シーケンス番号予想値の生成
  monitor_seq_num(mrd_seq_r_expect, int(s_udp_meridim.usval[MRD_SEQENTIAL]), MONITOR_SEQ); // シーケンス番号の表示

  if (mrd.seq_compare_nums(mrd_seq_r_expect, int(s_udp_meridim.usval[MRD_SEQENTIAL])))
  {
    s_udp_meridim.bval[MSG_ERR_u] &= B11111011; // [MSG_ERR] 9番ビット[Teensy受信のスキップ検出]をサゲる.
  }
  else // 受信シーケンシャルカウンタの値が予想と違ったら
  {
    mrd_seq_r_expect = int(s_udp_meridim.usval[MRD_SEQENTIAL]); // 現在の受信値を予想結果としてキープ
    s_udp_meridim.bval[MSG_ERR_u] |= B00000100;                 // Meridim[MSG_ERR] 9番ビット[Teensy受信のスキップ検出]をアゲる.
    // err_tsy_skip++;
  }

  //
  mrd.monitor_check_flow("[7]", MONITOR_FLOW); // デバグ用フロー表示

  //////// < 8 > フ レ ー ム 終 端 処 理 ////////////////////////////////////////////
  // @ [8-1] この時点で１フレーム内に処理が収まっていない時の処理
  now_t_mil = (long)millis(); // 現在時刻を更新
  if (now_t_mil > mrd_t_mil)
  {                               // 現在時刻がフレーム管理時計を超えていたらアラートを出す
    Serial.print("[ERR] delay:"); // シリアルに遅延msを表示
    Serial.println(now_t_mil - mrd_t_mil);
    digitalWrite(ERR_LED, HIGH); // 処理落ちが発生していたらLEDを点灯
  }
  else
  {
    digitalWrite(ERR_LED, LOW); // 処理が収まっていればLEDを消灯
  }

  // @ [8-2] この時点で時間が余っていたら時間消化。時間がオーバーしていたらこの処理を自然と飛ばす。
  now_t_mil = (long)millis();
  now_t_mic = (long)micros(); // 現在時刻を取得
  while ((mrd_t_mil - now_t_mil) >= 1)
  {
    delay(1);
    now_t_mil = (long)millis();
  }
  while (now_t_mic < mrd_t_mil * 1000)
  {
    now_t_mic = (long)micros(); // 現在時刻を取得
  }

  // @ [8-3] フレーム管理時計mercのカウントアップ
  mrd_t_mil = mrd_t_mil + frame_ms;             // フレーム管理時計を1フレーム分進める
  frame_count = frame_count + frame_count_diff; // サインカーブ動作用のフレームカウントをいくつずつ進めるかをここで設定。

  //
  mrd.monitor_check_flow("[8]", MONITOR_FLOW); // デバグ用フロー表示

  //////// < 9 > U D P 送 信 信 号 作 成 ////////////////////////////////////////////
  // @ [9-1] センサーからの値を送信用に格納
  if (MOUNT_IMUAHRS == 3)
  {
    for (int i = 0; i < 15; i++)
    {
      s_udp_meridim.sval[i] = mrd.float2HfShort(bno055_read[i]); // DMP_ROLL推定値
    }
  }

  // @ [9-2] フレームスキップ検出用のカウントをカウントアップして送信用に格納
  mrd_seq_s_increment = mrd.seq_increase_num(mrd_seq_s_increment);
  s_udp_meridim.usval[1] = mrd_seq_s_increment;

  // @ [9-3] チェックサムを計算して格納
  s_udp_meridim.sval[MSG_CKSM] = mrd.cksm_val(s_udp_meridim.sval, MSG_SIZE);

  //
  mrd.monitor_check_flow("[9]", MONITOR_FLOW); // デバグ用フロー表示

  //////// < 10 > U D P 送 信 //////////////////////////////////////////////////////
  // @ [10-1] UDP送信を実行
  if (UDP_SEND) // 設定でUDPの送信を行うかどうか決定
  {
    sendUDP();

    //
    mrd.monitor_check_flow("[10]\n", MONITOR_FLOW); // デバグ用フロー表示
  }
  // delayMicroseconds(1);
}

//================================================================================================================
//---- 関 数 各 種  -----------------------------------------------------------------------------------------------
//================================================================================================================

// void init_wifi(const char *wifi_ap_ssid, const char *wifi_ap_pass)
// {
//   WiFi.disconnect(true, true); // WiFi接続をリセット
//   delay(100);
//   WiFi.begin(wifi_ap_ssid, wifi_ap_pass); // Wifiに接続
//   while (WiFi.status() != WL_CONNECTED)
//   {            // https://www.arduino.cc/en/Reference/WiFiStatus 戻り値一覧
//     delay(50); // 接続が完了するまでループで待つ
//   }
// }

void receiveUDP()
{
  if (udp.parsePacket() >= MSG_BUFF) // データの受信バッファ確認
  {
    udp.read(r_udp_meridim.bval, MSG_BUFF); // データの受信
    udp_rsvd_flag = true;                   // 受信完了フラグを上げる
  }
  // delay(1);
}

