dreamdrive/Meridian_LITE/Meridian_LITE_for_ESP32/src/main.cpp
void sendUDP()
{
  udp.beginPacket(WIFI_SEND_IP, UDP_SEND_PORT); // UDPパケットの開始
  udp.write(s_udp_meridim.bval, MSG_BUFF);
  udp.endPacket(); // UDPパケットの終了
}

void check_sd()
{
  if (MOUNT_SD)
  {
    Serial.print("SD card check...");
    delay(100);
    if (!SD.begin(PIN_CHIPSELECT_SD))
    {
      Serial.println(" initialization FALIED!");
      delay(500);
    }
    else
    {
      Serial.println(" OK.");
    }

    if (CHECK_SD_RW)
    {
      // open the file.
      myFile = SD.open("/tmp.txt", FILE_WRITE);
      delayMicroseconds(2); // SPI安定化検証用

      // if the file opened okay, write to it:
      if (myFile)
      {
        Serial.print("SD card r/w check...");
        // SD書き込みテスト用のランダムな4桁の数字を生成
        randomSeed(long(analogRead(A0))); // 未接続ピンのノイズを利用
        int randNumber = random(1000, 9999);

        Serial.print(" write code ");
        Serial.print(randNumber);
        myFile.println(randNumber);
        delayMicroseconds(2); // SPI安定化検証用
        // close the file:
        myFile.close();
        Serial.print(" and");
        delayMicroseconds(10); // SPI安定化検証用
        // re-open the file for reading:
        myFile = SD.open("/tmp.txt");
        if (myFile)
        {
          Serial.print(" read code ");
          while (myFile.available())
          {
            Serial.write(myFile.read());
          }
          // close the file:
          myFile.close();
        }
        SD.remove("/tmp.txt");
        delay(10);
      }
      else
      {
        // if the file didn't open, print an error:
        Serial.println("Could not open SD test file.");
      }
    }
  }
  else
  {
    Serial.println("No SD reader/writer mounted.");
  }
}

void bt_settings()
{
  /* Wiiコントローラの接続開始 */
  if ((MOUNT_JOYPAD == 5) or (MOUNT_JOYPAD == 6))
  {
    Serial.println("Try to connect Wiimote...");
    wiimote.init();
  }
}

uint64_t joypad_read(int mount_joypad, uint64_t pre_val, int polling, bool joypad_reflesh)
{
  // if (mount_joypad == 2)
  // { // KRR5FH(KRC-5FH)をICS_R系に接続している場合
  //   joypad_polling_count++;
  //   if (joypad_polling_count >= polling)
  //   {
  //     static bool isFirstCall = true; // 初回の呼び出しフラグ
  //     if (isFirstCall)
  //     {
  //       Serial.println("KRC-5FH successfully connected. ");
  //       isFirstCall = false; // 初回の呼び出しフラグをオフにする
  //     }
  //     unsigned short buttonData;
  //     unsigned short pad_btn_tmp = 0;

  //     // buttonData = krs_R.getKrrButton(); ★★★★★★★★★★★★★★★★★★★★★★★
  //     delayMicroseconds(2);
  //     if (buttonData != KRR_BUTTON_FALSE) // ボタンデータが受信できていたら
  //     {
  //       int button_1 = buttonData;

  //       if (JOYPAD_GENERALIZE)
  //       {

  //         if ((button_1 & 15) == 15)
  //         { // 左側十字ボタン全部押しなら start押下とみなす
  //           pad_btn_tmp += 1;
  //         }
  //         else
  //         {
  //           // 左側の十字ボタン
  //           pad_btn_tmp += (button_1 & 1) * 16 + ((button_1 & 2) >> 1) * 64 + ((button_1 & 4) >> 2) * 32 + ((button_1 & 8) >> 3) * 128;
  //         }
  //         if ((button_1 & 368) == 368)
  //           pad_btn_tmp += 8; // 右側十字ボタン全部押しなら select押下とみなす
  //         else
  //         {
  //           // 右側十字ボタン
  //           pad_btn_tmp += ((button_1 & 16) >> 4) * 4096 + ((button_1 & 32) >> 5) * 16384 + ((button_1 & 64) >> 6) * 8192 + ((button_1 & 256) >> 8) * 32768;
  //         }
  //         // L1,L2,R1,R2
  //         pad_btn_tmp += ((button_1 & 2048) >> 11) * 2048 + ((button_1 & 4096) >> 12) * 512 + ((button_1 & 512) >> 9) * 1024 + ((button_1 & 1024) >> 10) * 256;
  //       }
  //       else
  //       {
  //         pad_btn_tmp = button_1;
  //       }
  //     }
  //     /* 共用体用の64ビットの上位16ビット部をボタンデータとして書き換える */
  //     uint64_t updated_val;
  //     if (joypad_reflesh)
  //     {
  //       updated_val = (pre_val & 0xFFFFFFFFFFFF0000) | (static_cast<uint64_t>(pad_btn_tmp)); // 上位16ビット index[0]
  //     }
  //     else
  //     {
  //       updated_val = (pre_val) | (static_cast<uint64_t>(pad_btn_tmp));
  //     }
  //     // updated_val = (updated_val & 0x0000FFFFFFFFFFFF) | (static_cast<uint64_t>(pad_btn_tmp) << 48); // 下位16ビット index[3]
  //     // updated_val = (updated_val & 0xFFFF0000FFFFFFFF) | (static_cast<uint64_t>(pad_btn_tmp) << 32); // 上位33-48ビット index[2]
  //     // updated_val = (updated_val & 0xFFFFFFFF0000FFFF) | (static_cast<uint64_t>(pad_btn_tmp) << 16); // 上位17-32ビット index[1]
  //     joypad_polling_count = 0;
  //     return updated_val;
  //   }
  //   else
  //   {
  //     return pre_val;
  //   }
  // }
  // else if (mount_joypad == 5) // wiimote_yoko
  // {
  //   uint64_t updated_val = 0;
  //   if (joypad_reflesh)
  //   {
  //     updated_val = (pre_val & 0xFFFFFFFFFFFF0000) | (static_cast<uint64_t>(pad_wiimote_receive())); // 上位16ビット index[0]
  //   }
  //   else
  //   {
  //     updated_val = (pre_val) | (static_cast<uint64_t>(pad_wiimote_receive()));
  //   }
  //   joypad_polling_count = 0;
  //   return updated_val;
  // }
  // else
  // {
  //   return pre_val;
  // }
  return 0;
}

uint16_t pad_wiimote_receive()
{
  wiimote.task();
  if (wiimote.available() > 0)
  {
    static bool isFirstCall = true; // 初回の呼び出しフラグ
    if (isFirstCall)
    {
      Serial.println("Wiimote successfully connected. ");
      isFirstCall = false; // 初回の呼び出しフラグをオフにする
    }
    uint16_t button = wiimote.getButtonState();
    pad_btn = 0;
    for (int i = 0; i < 16; i++)
    {
      uint16_t mask = 1 << i;
      if ((JOYPAD_GENERALIZE && (PAD_WIIMOTE_SOLO[i] & button)) || (!JOYPAD_GENERALIZE && (PAD_WIIMOTE_ORIG[i] & button)))
      {
        pad_btn |= mask;
      }
    }
    return pad_btn;
  }
  else
  {
    return pad_btn;
  }
  if (MOUNT_JOYPAD == 6)
  {
    Serial.println("Wiimote + Nunchuk not available now. "); //
  }
}

void init_imuahrs(int mount_imuahrs)
{
  if (mount_imuahrs == 3)
    if (!bno.begin())
    {
      Serial.println("No BNO055 detected ... Check your wiring or I2C ADDR!");
    }
    else
    {
      Serial.println("BNO055 mounted and started.");
      delay(50);
      bno.setExtCrystalUse(false);
      delay(10);
    }
  else
  {
    Serial.println("No IMU/AHRS sensor mounted.");
  }
}

void Core1_bno055_r(void *args)
{
  while (1)
  {
    /* 加速度センサ値の取得と表示 - VECTOR_ACCELEROMETER - m/s^2 */
    imu::Vector<3> accelermetor = bno.getVector(Adafruit_BNO055::VECTOR_ACCELEROMETER);
    bno055_read[0] = (float)accelermetor.x();
    bno055_read[1] = (float)accelermetor.y();
    bno055_read[2] = (float)accelermetor.z();

    /* ジャイロセンサ値の取得 - VECTOR_GYROSCOPE - rad/s */
    imu::Vector<3> gyroscope = bno.getVector(Adafruit_BNO055::VECTOR_GYROSCOPE);
    bno055_read[3] = gyroscope.x();
    bno055_read[4] = gyroscope.y();
    bno055_read[5] = gyroscope.z();

    /* 磁力センサ値の取得と表示  - VECTOR_MAGNETOMETER - uT */
    imu::Vector<3> magnetmetor = bno.getVector(Adafruit_BNO055::VECTOR_MAGNETOMETER);
    bno055_read[6] = magnetmetor.x();
    bno055_read[7] = magnetmetor.y();
    bno055_read[8] = magnetmetor.z();

    /* センサフュージョンによる方向推定値の取得と表示 - VECTOR_EULER - degrees */
    imu::Vector<3> euler = bno.getVector(Adafruit_BNO055::VECTOR_EULER);
    bno055_read[12] = euler.y();                          // DMP_ROLL推定値
    bno055_read[13] = euler.z();                          // DMP_PITCH推定値
    imuahrs_yaw_source = euler.x();                       // ヨー軸のソースデータ保持
    float yaw_tmp = euler.x() - 180 - imuahrs_yaw_origin; // DMP_YAW推定値
    if (yaw_tmp >= 180)
    {
      yaw_tmp = yaw_tmp - 360;
    }
    else if (yaw_tmp < -180)
    {
      yaw_tmp = yaw_tmp + 360;
    }
    bno055_read[14] = yaw_tmp; // DMP_YAW推定値

